import { Component } from '@angular/core';
import { CommonModule } from '@angular/common'; 

@Component({
  selector: 'app-about-us',
  standalone: true,
  imports: [CommonModule], 
  templateUrl: './about-us.html',
  styleUrls: ['./about-us.css'],
})
export class AboutUsComponent {
  
  aboutData = {
    header: {
      title: 'ჩვენ შესახებ',
      subtitle: 'დამატებითი ინფორმაცია ჩვენი გუნდისა და ჩვენი რესტორნის შესახებ',
      backgroundImage: 'assets/images/chiefs.jpg' 
    },
    history: {
      title: 'ისტორია',
      text: 'ორი ათეული წლის მანძილზე ბრენდი გაიზარდა და დღეს უკვე წარმატებული, ქართული ტრადიციული რესტორნების ქსელია, რომელიც მსოფლიოში ცნობილია, როგორც არქიტექტურის, კულტურის, სამზარეულოსა და ფოლკლორის გაცნობის საუკეთესო ადგილი. ჩვენი თავდადება არაერთი ჯილდოთია აღიარებული როგორც ქართულ, ასევე საერთაშორისო კონკურსებსა თუ დაჯილდოებებზე.'
    },
    story: {
      title: 'ჩვენი მისია',
      text: 'ჩვენ ვცდილობთ გავაზიაროთ საქართველოს მდიდარი კულტურული მემკვიდრეობა საკვებით, არქიტექტურითა და სტუმართმოყვარეობით.  ჩვენი მისიაა  საზოგადოებას მივაწოდოთ  ავთენტური და განსაკუთრებული ქართული კულინარიული გამოცდილება, რომელიც გამოხატულია ჩვენი ქვეყნისთვის დამახასიათებელი მდიდარი არომატებით, სტუმართმოყვარეობით.',
      image: 'assets/images/about-1.jpg' 
    },
    since1987: {
      title: '1987 წლიდან',
      paragraphs: [
        '1987 წელს დაარსდა ჩვენი რესტორანი და მას შემდეგ წარმატებით აძლიერებს სტუმართმოყვარეობის ინდუსტრიას საქართველოში.'
      ],
      image: 'assets/images/about-2.jpg' 
    },
    workingHours: {
      title: 'სამუშაო საათები',
      description: 'ჩვენი რესტორანი მუშაობს ყოველდღე, იხილეთ ზუსტი დრო:',
      schedule: [
        { day: 'ორშაბათი', time: '🕙 10სთ-23სთ' },
        { day: 'სამშაბათი', time: '🕙 10სთ-23სთ' },
        { day: 'ოთხშაბათი', time: '🕙 10სთ-23სთ' },
        { day: 'ხუთშაბათი', time: '🕙 10სთ-23სთ' },
        { day: 'პარასკევი', time: '🕙 10სთ-23სთ' },
        { day: 'შაბათი', time: '🕙 10სთ-23სთ' },
        { day: 'კვირა', time: '🕙 10სთ-23სთ' }
      ]
    }
  };
}